; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_6 ?v7 ?v13)
             (pred_9 ?v4 ?v6)
             (pred_10 ?v7 ?v6)
             (pred_1 ?v10 ?v7 )
	     (pred_7 ?v7)
             (pred_8 ?v9)
             (pred_3 ?v4)
             (pred_2 ?v6)
             (pred_4 ?v7)
             (pred_11 ?v4)
             (pred_12 ?v7)
             (pred_5 ))



(:action op_4
:parameters (?v5 ?v1 ?v12 ?v2)
:precondition (and (pred_8 ?v5) (pred_8 ?v1) (pred_3 ?v12) (pred_2 ?v2)
          (pred_6 ?v5 ?v1) (pred_9 ?v12 ?v2)
                   (pred_10 ?v1 ?v2) (pred_7 ?v5) 
                   (pred_4 ?v1) (pred_11 ?v12))
:effect (and  (pred_12 ?v1) (not (pred_4 ?v1))))


(:action op_3
:parameters (?v5 ?v11)
:precondition (and (pred_8 ?v5) (pred_8 ?v11)
               (pred_7 ?v5) (pred_6 ?v5 ?v11) (pred_12 ?v11))
:effect (and (pred_7 ?v11) (not (pred_7 ?v5))))

(:action op_2
:parameters (?v5 ?v12)
:precondition (and (pred_8 ?v5) (pred_3 ?v12) 
                  (pred_7 ?v5) (pred_1 ?v12 ?v5) (pred_5 ))
:effect (and (pred_11 ?v12)
   (not (pred_1 ?v12 ?v5)) (not (pred_5 ))))


(:action op_5
:parameters (?v5 ?v8 ?v3)
:precondition (and (pred_8 ?v5) (pred_3 ?v8) (pred_3 ?v3)
                  (pred_7 ?v5) (pred_11 ?v3) (pred_1 ?v8 ?v5))
:effect (and (pred_11 ?v8) (pred_1 ?v3 ?v5)
        (not (pred_11 ?v3)) (not (pred_1 ?v8 ?v5))))

(:action op_1
:parameters (?v5 ?v12)
:precondition (and (pred_8 ?v5) (pred_3 ?v12) 
                  (pred_7 ?v5) (pred_11 ?v12))
:effect (and (pred_5 ) (pred_1 ?v12 ?v5) (not (pred_11 ?v12)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_14 obj_09 obj_08 obj_18 obj_02 obj_05 obj_21 obj_07 obj_22 obj_16 obj_30 obj_28 obj_10 obj_26 obj_01 obj_17 obj_15 obj_06 obj_03 obj_27 obj_29 obj_04 obj_31 obj_23 obj_24
    obj_25 obj_20 obj_11
    obj_12 obj_19 obj_13
    )

    (:init
       (pred_5)

       (pred_8 obj_14)
       (pred_8 obj_09)
       (pred_8 obj_08)
       (pred_8 obj_18)
       (pred_8 obj_02)
       (pred_8 obj_05)
       (pred_8 obj_21)
       (pred_8 obj_07)
       (pred_8 obj_22)
       (pred_8 obj_16)
       (pred_8 obj_30)
       (pred_8 obj_28)
       (pred_8 obj_10)
       (pred_8 obj_26)
       (pred_8 obj_01)
       (pred_8 obj_17)
       (pred_8 obj_15)
       (pred_8 obj_06)
       (pred_8 obj_03)
       (pred_8 obj_27)
       (pred_8 obj_29)
       (pred_8 obj_04)
       (pred_8 obj_31)
       (pred_8 obj_23)
       (pred_8 obj_24)
       (pred_2 obj_25)
       (pred_2 obj_20)
       (pred_2 obj_11)
       (pred_3 obj_12)
       (pred_3 obj_19)
       (pred_3 obj_13)

       (pred_6 obj_14 obj_05)
       (pred_6 obj_14 obj_09)
       (pred_6 obj_09 obj_21)
       (pred_6 obj_09 obj_08)
       (pred_6 obj_09 obj_14)
       (pred_6 obj_08 obj_07)
       (pred_6 obj_08 obj_18)
       (pred_6 obj_08 obj_09)
       (pred_6 obj_18 obj_22)
       (pred_6 obj_18 obj_02)
       (pred_6 obj_18 obj_08)
       (pred_6 obj_02 obj_16)
       (pred_6 obj_02 obj_18)
       (pred_6 obj_05 obj_30)
       (pred_6 obj_05 obj_21)
       (pred_6 obj_05 obj_14)
       (pred_6 obj_21 obj_28)
       (pred_6 obj_21 obj_07)
       (pred_6 obj_21 obj_09)
       (pred_6 obj_21 obj_05)
       (pred_6 obj_07 obj_10)
       (pred_6 obj_07 obj_22)
       (pred_6 obj_07 obj_08)
       (pred_6 obj_07 obj_21)
       (pred_6 obj_22 obj_26)
       (pred_6 obj_22 obj_16)
       (pred_6 obj_22 obj_18)
       (pred_6 obj_22 obj_07)
       (pred_6 obj_16 obj_01)
       (pred_6 obj_16 obj_02)
       (pred_6 obj_16 obj_22)
       (pred_6 obj_30 obj_17)
       (pred_6 obj_30 obj_28)
       (pred_6 obj_30 obj_05)
       (pred_6 obj_28 obj_15)
       (pred_6 obj_28 obj_10)
       (pred_6 obj_28 obj_21)
       (pred_6 obj_28 obj_30)
       (pred_6 obj_10 obj_06)
       (pred_6 obj_10 obj_26)
       (pred_6 obj_10 obj_07)
       (pred_6 obj_10 obj_28)
       (pred_6 obj_26 obj_03)
       (pred_6 obj_26 obj_01)
       (pred_6 obj_26 obj_22)
       (pred_6 obj_26 obj_10)
       (pred_6 obj_01 obj_27)
       (pred_6 obj_01 obj_16)
       (pred_6 obj_01 obj_26)
       (pred_6 obj_17 obj_29)
       (pred_6 obj_17 obj_15)
       (pred_6 obj_17 obj_30)
       (pred_6 obj_15 obj_04)
       (pred_6 obj_15 obj_06)
       (pred_6 obj_15 obj_28)
       (pred_6 obj_15 obj_17)
       (pred_6 obj_06 obj_31)
       (pred_6 obj_06 obj_03)
       (pred_6 obj_06 obj_10)
       (pred_6 obj_06 obj_15)
       (pred_6 obj_03 obj_23)
       (pred_6 obj_03 obj_27)
       (pred_6 obj_03 obj_26)
       (pred_6 obj_03 obj_06)
       (pred_6 obj_27 obj_24)
       (pred_6 obj_27 obj_01)
       (pred_6 obj_27 obj_03)
       (pred_6 obj_29 obj_04)
       (pred_6 obj_29 obj_17)
       (pred_6 obj_04 obj_31)
       (pred_6 obj_04 obj_15)
       (pred_6 obj_04 obj_29)
       (pred_6 obj_31 obj_23)
       (pred_6 obj_31 obj_06)
       (pred_6 obj_31 obj_04)
       (pred_6 obj_23 obj_24)
       (pred_6 obj_23 obj_03)
       (pred_6 obj_23 obj_31)
       (pred_6 obj_24 obj_27)
       (pred_6 obj_24 obj_23)
       (pred_4 obj_26)
       (pred_4 obj_31)
       (pred_4 obj_29)
       (pred_10  obj_26 obj_25)
       (pred_10  obj_31 obj_20)
       (pred_10  obj_29 obj_11)
       (pred_12 obj_14)
       (pred_12 obj_09)
       (pred_12 obj_08)
       (pred_12 obj_18)
       (pred_12 obj_02)
       (pred_12 obj_05)
       (pred_12 obj_21)
       (pred_12 obj_07)
       (pred_12 obj_22)
       (pred_12 obj_16)
       (pred_12 obj_30)
       (pred_12 obj_28)
       (pred_12 obj_10)
       (pred_12 obj_01)
       (pred_12 obj_17)
       (pred_12 obj_15)
       (pred_12 obj_06)
       (pred_12 obj_03)
       (pred_12 obj_27)
       (pred_12 obj_04)
       (pred_12 obj_23)
       (pred_12 obj_24)

       (pred_9  obj_12 obj_25)
       (pred_9  obj_19 obj_20)
       (pred_9  obj_13 obj_11)
       (pred_1 obj_12 obj_09)
       (pred_1 obj_19 obj_06)
       (pred_1 obj_13 obj_27)
       (pred_7 obj_17)
    )

    (:goal (and
       (pred_1 obj_12 obj_26)
       (pred_1 obj_13 obj_16)
    ))
(:constraints
  (always (not (pred_7 obj_22)))
)
)

; plan
1. (op_3 obj_17 obj_15)
   deleted: (pred_7 obj_17)
   added: (pred_7 obj_15)
   goals met: 0 of 2
2. (op_3 obj_15 obj_06)
   deleted: (pred_7 obj_15)
   added: (pred_7 obj_06)
   goals met: 0 of 2
3. (op_3 obj_06 obj_03)
   deleted: (pred_7 obj_06)
   added: (pred_7 obj_03)
   goals met: 0 of 2
4. (op_3 obj_03 obj_27)
   deleted: (pred_7 obj_03)
   added: (pred_7 obj_27)
   goals met: 0 of 2
5. (op_2 obj_27 obj_13)
   deleted: (pred_1 obj_13 obj_27) (pred_5)
   added: (pred_11 obj_13)
   goals met: 0 of 2
6. (op_3 obj_27 obj_01)
   deleted: (pred_7 obj_27)
   added: (pred_7 obj_01)
   goals met: 0 of 2
7. (op_3 obj_01 obj_16)
   deleted: (pred_7 obj_01)
   added: (pred_7 obj_16)
   goals met: 0 of 2
8. (op_1 obj_16 obj_13)
   deleted: (pred_11 obj_13)
   added: (pred_5) (pred_1 obj_13 obj_16)
   goals met: 1 of 2
9. (op_3 obj_16 obj_02)
   deleted: (pred_7 obj_16)
   added: (pred_7 obj_02)
   goals met: 1 of 2
10. (op_3 obj_02 obj_18)
   deleted: (pred_7 obj_02)
   added: (pred_7 obj_18)
   goals met: 1 of 2
11. (op_3 obj_18 obj_08)
   deleted: (pred_7 obj_18)
   added: (pred_7 obj_08)
   goals met: 1 of 2
12. (op_3 obj_08 obj_09)
   deleted: (pred_7 obj_08)
   added: (pred_7 obj_09)
   goals met: 1 of 2
13. (op_2 obj_09 obj_12)
   deleted: (pred_1 obj_12 obj_09) (pred_5)
   added: (pred_11 obj_12)
   goals met: 1 of 2
14. (op_3 obj_09 obj_08)
   deleted: (pred_7 obj_09)
   added: (pred_7 obj_08)
   goals met: 1 of 2
15. (op_3 obj_08 obj_07)
   deleted: (pred_7 obj_08)
   added: (pred_7 obj_07)
   goals met: 1 of 2
16. (op_3 obj_07 obj_10)
   deleted: (pred_7 obj_07)
   added: (pred_7 obj_10)
   goals met: 1 of 2
17. (op_4 obj_10 obj_26 obj_12 obj_25)
   deleted: (pred_4 obj_26)
   added: (pred_12 obj_26)
   goals met: 1 of 2
18. (op_3 obj_10 obj_26)
   deleted: (pred_7 obj_10)
   added: (pred_7 obj_26)
   goals met: 1 of 2
19. (op_1 obj_26 obj_12)
   deleted: (pred_11 obj_12)
   added: (pred_5) (pred_1 obj_12 obj_26)
   goals met: 2 of 2
